Tekla.Structures.Analysis.DotAnalysisModelObjectOperation
The serialization structure for analysis model object operations.

Tekla.Structures.Analysis.DotAnalysisModelObjectOperation._AnalysisObject
The analysis object instance (analysis model).

Tekla.Structures.Analysis.DotAnalysisModelObjectOperation._ObjectID
ID of object

Tekla.Structures.Analysis.DotAnalysisModelObjectOperation._Operation
Operation

Tekla.Structures.Analysis.DotAnalysisModelObjectOperation.ToStruct(Tekla.Structures.Analysis.AnalysisModel,Tekla.Structures.Model.Object,System.Int32)
DO NOT USE! For internal usage only!
P: P.
ModelObject: ModelPart
Operation: Operation